; domain
(define (domain king)
  (:requirements :strips)
  (:predicates
    (at ?p ?x ?y)
    (adjacent ?y1 ?y2)
    (occupied ?x ?y)
  )
  (:action move
    :parameters (?p ?x1 ?y1 ?x2 ?y2)
    :precondition (and
        (at ?p ?x1 ?y1)
        (not (occupied ?x2 ?y2))
        (or (and (= ?x1 ?x2) (adjacent ?y1 ?y2))
            (and (= ?x1 ?x2) (adjacent ?y2 ?y1))
            (and (= ?y1 ?y2) (adjacent ?x1 ?x2))
            (and (= ?y1 ?y2) (adjacent ?x2 ?x1))
            (and (adjacent ?x1 ?x2) (adjacent ?y1 ?y2))
        )
    )
    :effect (and
        (not (at ?p ?x1 ?y1))
        (at ?p ?x2 ?y2)
        (occupied ?x2 ?y2)
        (not (occupied ?x1 ?y1))
    )
  )
)

; problem
(define (problem single-king-problem)
  (:domain king)
  (:objects
    king
    x1 x2 x3 x4 x5 x6 x7
    y1 y2 y3 y4 y5 y6 y7 y8
  )
  (:init  
    (at king x1 y1)
    (adjacent x1 x2)
    (adjacent x2 x3)
    (adjacent x3 x4)
    (adjacent x4 x5)
    (adjacent x5 x6)
    (adjacent x6 x7)
    (adjacent x7 x6)
    (adjacent x6 x5)
    (adjacent x5 x4)
    (adjacent x4 x3)
    (adjacent x3 x2)
    (adjacent x2 x1)

    (adjacent y1 y2)
    (adjacent y2 y3)
    (adjacent y3 y4)
    (adjacent y4 y5)
    (adjacent y5 y6)
    (adjacent y6 y7)
    (adjacent y7 y8)
    (adjacent y8 y7)
    (adjacent y7 y6)
    (adjacent y6 y5)
    (adjacent y5 y4)
    (adjacent y4 y3)
    (adjacent y3 y2)
    (adjacent y2 y1)

    (occupied x7 y7)
    (occupied x6 y7)
  )
  (:goal (at king x7 y8))
)

; plan
1. (move king x1 y1 x1 y2)
   deleted: (at king x1 y1)
   added: (at king x1 y2) (occupied x1 y2)
   goals met: 0 of 1
2. (move king x1 y2 x2 y3)
   deleted: (at king x1 y2) (occupied x1 y2)
   added: (at king x2 y3) (occupied x2 y3)
   goals met: 0 of 1
3. (move king x2 y3 x3 y4)
   deleted: (at king x2 y3) (occupied x2 y3)
   added: (at king x3 y4) (occupied x3 y4)
   goals met: 0 of 1
4. (move king x3 y4 x4 y5)
   deleted: (at king x3 y4) (occupied x3 y4)
   added: (at king x4 y5) (occupied x4 y5)
   goals met: 0 of 1
5. (move king x4 y5 x5 y6)
   deleted: (at king x4 y5) (occupied x4 y5)
   added: (at king x5 y6) (occupied x5 y6)
   goals met: 0 of 1
6. (move king x5 y6 x5 y7)
   deleted: (at king x5 y6) (occupied x5 y6)
   added: (at king x5 y7) (occupied x5 y7)
   goals met: 0 of 1
7. (move king x5 y7 x6 y8)
   deleted: (at king x5 y7) (occupied x5 y7)
   added: (at king x6 y8) (occupied x6 y8)
   goals met: 0 of 1
8. (move king x6 y8 x7 y8)
   deleted: (at king x6 y8) (occupied x6 y8)
   added: (at king x7 y8) (occupied x7 y8)
   goals met: 1 of 1
